Revit 2027 API
FamilyManager.MakeNonReporting Method
Set the reporting family parameter as a regular/driving parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MakeNonReporting(
	FamilyParameter familyParameter
)
Public Sub MakeNonReporting (
	familyParameter As FamilyParameter
)
public:
void MakeNonReporting(
	FamilyParameter^ familyParameter
)
member MakeNonReporting :
        familyParameter : FamilyParameter -> unit
Parameters
familyParameter FamilyParameter
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"familyParameter"-is null.
InvalidOperationException |  Thrown when attempting to make a parameter which is labeled to an arc length dimension non-reporting.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace